LT-Easytravel.yml
---
execution:
  scenario: LT-Easytravel
  concurrency: 30
  ramp-up: 1m
  hold-for: 1m
scenarios:
  LT-Easytravel:
    headers:
    requests:
      - url: 'http://ec2-54-210-22-3.compute-1.amazonaws.com:8079/'
        method: GET
        label: 'easytravel-frontend'
        think-time: 0ms
      - url: 'http://ec2-54-210-22-3.compute-1.amazonaws.com:8079/rating/ratings.php'
        method: POST
        label: 'easytravel-ratings'
        body:
          info: '1'
          journey_id: '11'
      - url: 'http://ec2-54-210-22-3.compute-1.amazonaws.com:8079/CalculateRecommendations'
        method: GET
        label: 'easytravel-CalculateRecommendations'
        body:
          _: '1523225235535'
      - url: 'http://ec2-54-210-22-3.compute-1.amazonaws.com:8079/amp/'
        method: GET
        label: 'easytravel-amp'
        think-time: 1608ms
      - url: 'http://ec2-54-210-22-3.compute-1.amazonaws.com:8079/amp/italy/'
        method: GET
        label: 'easytravel-italy/'
        think-time: 4395ms
services:
- module: passfail
  criteria:
  - avg-rt>50ms for 10s, stop as failed
  - hits of easytravel-frontend >100 for 10s, continue as failed
reporting:
- module: junit-xml
  filename: /var/lib/jenkins/workspace/Taurus-Jenkins-ServiceNow-Demo/junit-report.xml
  data-source: pass-fail