script1.yml
---
execution:
- concurrency: 10
  hold-for: 1m
  ramp-up: 30s
  scenario: Thread Group
scenarios:
  Thread Group:
    requests:
    - label: blazedemo
      method: GET
      url: http://blazedemo.com/
    - body:
        fromPort: Paris
        toPort: Buenos Aires
      label: reserve
      method: POST
      url: http://blazedemo.com/reserve.php
services:
- module: passfail
  criteria:
  - avg-rt>10ms for 7s, stop as failed
  - hits of reserve >10 for 13s, continue as failed
reporting:
- module: junit-xml
  filename: /var/lib/jenkins/workspace/Test/junit-report.xml
  data-source: pass-fail